const secretFields = [
  // {
  //   text: 'Парламент ухвалив закон про податок на повітря. Він/Вона повинен(на) сплатити 500mm',
  //   amounts: [-500],
  //   numOfPlayersInvolved: 'one',
  // },
  {
    text: 'СБУ несподівано навідалася до всіх гравців. Усі втрачають по 700mm, окрім нього/неї – він/вона встиг(ла) зламати телефон.',
    amounts: [-700],
    numOfPlayersInvolved: 'all',
  },
  // {
  //   text: 'Янукович вирішив повернутися, і він/вона повинен(на) скинути 1000mm на його "золотий батон".',
  //   amounts: [-1000],
  //   numOfPlayersInvolved: 'one',
  // },
  // {
  //   text: 'ЄС вирішив надати Україні фінансову підтримку. Він/Вона отримує 2000, бо його/її документи першими дійшли до Брюсселя.',
  //   amounts: [2000],
  //   numOfPlayersInvolved: 'one',
  // },
  {
    text: '(Обрання рандомного гравця) доніс на нього/неї в НАБУ через незадеклароване майно, яке він/вона не вказав(ла) в своїх фінансових документах. Заплатить 1500mm штрафу. Він за це отримує винагороду 3500mm',
    amounts: [-1500, 3500],
    numOfPlayersInvolved: 'two',
  },
  // {
  //   text: 'Гривня несподівано зміцнилася, і він/вона заробив(ла) на обміні валют. Отримує 1500mm.',
  //   amounts: [1500],
  //   numOfPlayersInvolved: 'one',
  // },
  // {
  //   text: 'Він/Вона продав(ла) кабанчика за рекордну ціну. Отримує 2000mm',
  //   amounts: [2000],
  //   numOfPlayersInvolved: 'one',
  // },
  // {
  //   text: 'Він/Вона виконав(ла) пісню "Ведмеді-Балалайки" в караоке, і отримує 500mm.',
  //   amounts: [500],
  //   numOfPlayersInvolved: 'one',
  // },
  // {
  //   text: 'Він/Вона виконав(ла) пісню "Ванька-Встанька" в караоке, і отримує 500mm.',
  //   amounts: [500],
  //   numOfPlayersInvolved: 'one',
  // },
  // {
  //   text: 'Він/Вона виконав(ла) пісню "Я танцюю гопака, гоп-гоп гопака" в караоке, і отримує 500mm.',
  //   amounts: [500],
  //   numOfPlayersInvolved: 'one',
  // },
  // {
  //   text: 'Він/Вона виконав(ла) пісню "Павук" в караоке, і отримує 1250mm.',
  //   amounts: [1250],
  //   numOfPlayersInvolved: 'one',
  // },
  // {
  //   text: 'Він/Вона виконав(ла) пісню "Як тебе не любити, Києве мій!" в караоке, і отримує 4000mm.',
  //   amounts: [4000],
  //   numOfPlayersInvolved: 'one',
  // },
  {
    text: 'Він/Вона ініціював(ла) ремонт дороги, і всі жителі вдячні. Отримує по 300mm від кожного гравця за "дорожній збір".',
    amounts: [null, -300],
    numOfPlayersInvolved: 'all',
  },
  // {
  //   text: 'Він/Вона знайшов(ла) величезну кількість білих грибів. Отримує 800mm за їх продаж.',
  //   amounts: [800],
  //   numOfPlayersInvolved: 'one',
  // },
  // {
  //   text: 'Він/Вона виграв(ла) золоту медаль. Отримує 1500mm від уряду за досягнення.',
  //   amounts: [1500],
  //   numOfPlayersInvolved: 'one',
  // },
  // {
  //   text: 'Коломойський попросив його/її "передати передачу". Заплатить 500mm, бо відмовити йому страшно.',
  //   amounts: [-500],
  //   numOfPlayersInvolved: 'one',
  // },
  // {
  //   text: 'Уряд ухвалив рішення про підвищення тарифів на воду, газ і електрику. Він/Вона повинен(на) сплатити 800mm за нові комунальні витрати.',
  //   amounts: [-800],
  //   numOfPlayersInvolved: 'one',
  // },
];

export type SecretType = (typeof secretFields)[0];
export default secretFields;
